export type AlphabetMap = {
	[key: string]: string[];
};


export const ALPHABET_MAP_DIACRITICS: AlphabetMap = {
	'a': [ 'a', 'á', 'ä' ],
	'b': [ 'b' ],
	'c': [ 'c', 'č' ],
	'd': [ 'd', 'ď' ],
	'e': [ 'e', 'é', 'ě', 'ë' ],
	'f': [ 'f' ],
	'g': [ 'g' ],
	'h': [ 'h' ],
	'i': [ 'i', 'í', 'ï' ],
	'j': [ 'j' ],
	'k': [ 'k' ],
	'l': [ 'l' ],
	'm': [ 'm' ],
	'n': [ 'n', 'ň' ],
	'o': [ 'o', 'ó', 'ö' ],
	'p': [ 'p' ],
	'q': [ 'q' ],
	'r': [ 'r', 'ř' ],
	's': [ 's', 'š' ],
	't': [ 't', 'ť' ],
	'u': [ 'u', 'ú', 'ů', 'ü' ],
	'v': [ 'v' ],
	'w': [ 'w' ],
	'x': [ 'x' ],
	'y': [ 'y', 'ý', 'ÿ' ],
	'z': [ 'z', 'ž' ]
};
